// Нарисуйте ромб

//          1
//         121
//        12321
//       1234321
//      123454321
//     12345654321
//    1234567654321
//   123456787654321
//  12345678987654321
// 1234567890987654321
//  12345678987654321
//   123456787654321
//    1234567654321
//     12345654321
//      123454321
//       1234321
//        12321
//         121
//          1


let newStr = '';
for ( let i = 1; i <= 5; i++){
    for (let j = 1; j <=i ; j++){
        newStr += j

    }
    newStr += '\n'
}
console.log(newStr)

let newStr2 = ''
let x = 5
let space = ' '

for (let i = 1; i <= x; i++){
    newStr2 += space.repeat(x - i)
    for (let j = 1; j <= i; j++){
        newStr2 += j
    }
    newStr2 += '\n'
}
console.log(newStr2)

let row = ''
for (let i = 1; i <= 5; i++){
    row += i;
}
console.log(row)


// let newStr4 = ''
// for (let i = 1; j <= x 







//          2. Нарисуйте елочку
//          *
//        ***
//       *****
//      *******
//     *********
//     3. Нарисуйте треугольник
//     1 
//     2 6 
//     3 7 10 
//     4 8 11 13 
//     5 9 12 14 15